Nexus schema integrate and doc update
